#include<stdio.h>
#include<string.h>
#include<assert.h>

//------------------------------------------------------------------------------------
                                                                     //判断素数的函数

//int isprime(int num){
//	
//	for (int i = 2; i < num; i++){
//		if (num % i == 0){
//			return 0;
//		}
//			
//	}
//	    return 1;
//
//}


//------------------------------------------------------------------------------------
                                                                     //二分查找的函数

         //!!!!!!!!!!!!!!  不可直接在函数求长度，因为传过来的是数组第一位，，是地址可以看做指针


          //arr本质是指针                                             
//int findarr(int arr[], int num, int right){
//
//	//数组最左边下标
//	int left = 0;
//
//
//	//数组中间下标
//	int mid;
//
//	while (left <= right){
//
//		//每次都判断中间的数
//		mid = (left + right) / 2;
//
//		if (arr[mid] > num){
//			right = mid - 1;
//		}
//		else if(arr[mid] < num){
//			left = mid + 1;
//		}
//		else if (arr[mid] == num){
//			return mid;
//		}
//	}
//	return -1;
//}

//------------------------------------------------------------------------------------
                                                    //写一个函数，每次调用一次，num+1
//void add_num(int* p1){
//
//	*p1 = *p1 + 1;
//	//!!!!!!!!!!!!!!!!!     不可以写成 p1++
//
//}



//-----------------------------------------------------------------------------------
                                                               //拷贝字符串

void my_strcop(char* arr, char* arr1){
	while (*arr1 != '\0'){

		*arr = *arr1;
		//地址加一
		arr = arr + 1;
		arr1 = arr1 + 1;
	}

	*arr = *arr1;

}

void my_strcop1(char* arr, char* arr1){
	while (*(arr++) = *(arr1++)){
		;
	}
}

char* my_strcop2(char* arr, const char* arr1){
	char* result = arr;
	//arr断言
	assert( arr != NULL );
	//arr1断言
	assert(arr1 != NULL);
	while (*(arr++) = *(arr1++)){
		;
	}
	return result;
}

//=============================================================================================
                                                                 //	模拟实现strlen()函数
int my_strlen(const char* arr){
	//断言
	assert(arr != NULL);
	//计数
	int count = 0;
	while (*(arr++) != '\0'){
		count++;
	}
	return count;
}





int main(){
//=============================================================================================
                                                                   //	模拟实现strlen()函数
	
	int a = 0;
	int c = 0;
	c = a + 1;
	printf("%d %d\n", a, c);

	//char arr[20] = "Hellow World!!";
	////打印长度
	//printf("--------------------------------------------\n");
	//printf("%d\n", my_strlen(arr));
	//char arr1[20] = "aaaaaaaaaa";
	//printf("--------------------------------------------\n");
	//printf("%d\n", my_strlen(arr1));





//=============================================================================================

	//int num = 0;

	//add_num(&num);
	//add_num(&num);
	//add_num(&num);
	//add_num(&num);
	//add_num(&num);

	//printf("%d\n", num);




	//写一个数组拷贝函数
	//---------------------------------------------------------------------------
	//char arr[30] = "xxxxxxxxxxxxxx";
	//char arr1[30] = "Hello World!";
	////第一个为目标数组，第二个为替换数组
	////my_strcop(arr, arr1);
	////printf("%s\n",arr);
	//printf("--------------------------------------------\n");
	////my_strcop1(arr, arr1);

	//printf("%s\n", my_strcop2(arr,arr1));


//--------------------------------------------------------------------------------------
                                                    //预防const修饰的常变量通过指针改变
	//const int i = 10;
	////报错
	////i = 20;

	////不会报错
	//int* p = &i;
	//*p = 20;

	////这样就无法通过指针变量修改const修饰的变量
	////表示无法通过指针变量p来修改，表示指针指向的内容无法通过指针来改变
	////const修饰* p，表示p这个指针变量指向的内容无法通过指针改变
	/////const int* p1 = &i;
	//int const * p1 = &i;

	////const 修饰的是p变量
	////p变量无法改变，地址无法改变
	//int* const p2 = &i;





	













//------------------------------------------------------------------------------------
	//int arr[] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
	//printf("%d\n", findarr(arr, 5, (sizeof(arr) / sizeof(arr[0]))-1));
//------------------------------------------------------------------------------------




//------------------------------------------------------------------------------------
                                                                     //判断素数的函数
	//while (1){
	//	//储存判断的数字
	//	int num;
	//	//输入数字
	//	printf("\n请输入判断的数字：\n");
	//	scanf_s("%d", &num);
	//	if ((isprime(num)) == 1){
	//		printf("%d是素数！", num);
	//	}
	//	else{
	//		printf("%d不是素数！！", num);
	//	}

	//}
//------------------------------------------------------------------------------------



//------------------------------------------------------------------------------------
	//strcpy(被替换的函数，替换的函数)函数 完成字符串拷贝    \0也会拷贝
	//char arr1[] = "Hello World!";
	//char arr2[] = "?????????????????????";

	//printf("%s\n", arr1);
	//printf("%s\n", arr2);
 //   //Hello World!
	///*? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ?*/

	//strcpy(arr2, arr1);
	//printf("%s\n", arr1);
	//printf("%s\n", arr2);
	//Hello World!
	//Hello World!
//------------------------------------------------------------------------------------
	     //memset(指针地址，设定的值，前几个设置成这个值);   memory - set  内存设置
//------------------------------------------------------------------------------------


	return 0;
}