#include<stdio.h>
#include<math.h>

//-----------------------------------------------------------------------
// a = 2, n = 4
// = 2 + 22 +222 +2222
//int sum(int a, int n){
//	//接受相加的数
//	int num = 0;
//	int num1 = 0;
//	for (int i = 0; i < n; i++){
//
//		num1 = (a * (pow(10,i)) + num1);
//		num = num + num1;
//
//		
//	}
//	return num;
//}

//-----------------------------------------------------------------------
//void printf_arr(int (*parr)[10], int geshu ){
//	int count = 0;
//	while (geshu != count){
//		printf("%d ", *((*parr) + count));
//		count++;
//	}
//	
//
//}
//-----------------------------------------------------------------------
                             //判断一个数为几位数
//int my_judge(int num){
//	for (int i = 0; i <= 100; i++){
//		if ((num / (int)pow(10, i)) <= 9){
//			return i+1;
//		}
//	}
//
//}


//-----------------------------------------------------------------------
                                                          //打印菱形
//void my_printf(int hang){
//
//	//正序打印
//	//决定行数
//	for (int i = 1; i <= hang; i++){
//		//打印空格
//		for (int n = hang - i; n > 0; n--){
//			printf(" ");
//		}
//		for (int j = 1; j <= i; j++){
//			printf("* ");
//		}
//		//换行
//		printf("\n");
//	}
//	//逆序打印
//	for (int i1 = hang - 1; i1 > 0; i1--){
//		//打印空格
//		for (int n1 = 0; n1 < hang-i1; n1++){
//			printf(" ");
//		}
//		//打印*
//		for (int j1 = i1; j1 > 0; j1--){
//			printf("* ");
//		}
//		//换行
//		printf("\n");
//
//	}
//
//}

//-----------------------------------------------------------------------
//int drink(int yuan){
//	//统计空瓶子
//	int count = 0;
//	//统计总共几个瓶子
//	int sum = 0;
//	for (int i = yuan; i > 0; i--){
//		//买一瓶汽水
//		//两瓶换一瓶，相当于两瓶后，加一元
//		count++;
//		if ( 2 == count){
//			i = i + 1;
//			count = 0;
//		}
//		//总共瓶子
//		sum = sum + 1;
//
//	}
//	return sum;
//}
//-----------------------------------------------------------------------
												//函数指针数组
int Add(int x, int y){
	return x + y;
}

int Sub(int x, int y){
	return x - y;
}


//-----------------------------------------------------------------------
int main(){
	//-----------------------------------------------------------------------	
															//函数指针数组
	//定义Add函数的函数指针
	int(*padd)(int, int) = &Add;
	//定义Sub函数的函数指针
	int (*psub)(int, int) = &Sub;
	//定义函数指针数组
	int(*parr[2])(int, int) = { padd, psub };
	/*printf("%d %d", (*(parr))(2, 5), (*(parr+1))(2, 5));*/
	printf("%d %d ", parr[1](1, 2), parr[0](1, 2));
		






	//-----------------------------------------------------------------------	
	////输入a和n，求  Sn = a + aa + aaa   n=3
	//int a = 0;
	//int n = 0;
	//printf("%d\n", sum(2, 5));
	//-----------------------------------------------------------------------

	//使用指针打印整型数组
	//int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
	//printf_arr(&arr,sizeof(arr)/sizeof(arr[0]));
	//-----------------------------------------------------------------------
	                                                             //求水仙花数
	//for (int i = 0; i <= 1000; i++){
	//	int weishu = my_judge(i);
	//	int sum = 0;
	//	if (i == (pow(i / 100, weishu) + pow(i / 10 % 10, weishu) + pow(i % 10, weishu))){
	//		printf("%d ",i);
	//	}

	//	

	//}
	//for (int i = 0; i <= 100000; i++){
	//	int weishu = my_judge(i);
	//	int sum = 0;
	//	if (i == (pow(i / 10000, weishu) + pow(i / 1000 % 10, weishu) + pow(i / 100 % 10, weishu) + pow(i / 10 % 10, weishu) + pow(i % 10, weishu))){
	//		printf("%d ", i);
	//	}
	//}

	//for (int i = 0; i <= 100000; i++){
	//	int num = i;
	//	int sum = 0;
	//	int weishu = my_judge(i);
	//	while (num){
	//		sum = sum + pow(num % 10, weishu);
	//		num = num / 10;

	//	}
	//	if (i == sum){
	//		printf("%d ", i);
	//	}
	//}
	
	
	//0 1 2 3 4 5 6 7 8 9 153 370 371 407 1634 8208 9474 54748 92727 93084
	//-----------------------------------------------------------------------	
	                          //打印菱形
	/*my_printf(15);*///输入几行菱形
	
	//-----------------------------------------------------------------------
	//喝汽水，一瓶一元，两个空瓶换一个汽水，可以喝多少
	/*printf("%d\n", drink(20));*/
	//-----------------------------------------------------------------------
	                                                          //打印杨辉三角
	
	//1
	//1  1
	//1  2  1
	//1  3  3  1
	//1  4  6  4  1 
	//1  5  10 10 5  1

	//[2][1] = [1][0] + [1][1]
	//[3][1] = [2][0] + [2][1]
	
	////定义空白二维数组
	//int arr[10][10] = { 0 };
	////[0][0],[1][1],[2][2]...均为1
	////[i][0]均为1
	////先令他们为1
	//for (int i = 0; i < 10; i++){		
	//	for (int j = 0; j <= i; j++){

			////[i][0]置1
			//if (0 == j){
			//	arr[i][j] = 1;
			//}
			////i和j相等置1
			//if (j == i){
			//	arr[i][j] = 1;
			//}
			//if (0 != j && j != i){
			//	//判断加法规律
			//	arr[i][j] = arr[i - 1][j - 1] + arr[i - 1][j];

			//优化-----------------------------------------------------------
	//		if ((0 == j) || (j == i)){
	//			arr[i][j] = 1;
	//		}
	//		else{
	//			arr[i][j] = arr[i - 1][j - 1] + arr[i - 1][j];
	//		}
	//	}		
	//}
	//
	////打印数组
	//for (int i = 0; i < 10; i++){
	//	//打印空格
	//	for (int n = 10-i; n >= 0; n--){
	//		printf(" ");
	//	}
	//	for (int j = 0; j <= i; j++){
	//		printf("%d ", arr[i][j]);
	//	}
	//	//换行
	//	printf("\n");
	//}
	    


 

    //-----------------------------------------------------------------------	
	return 0;
}