#include<stdio.h>
#include<windows.h>
#include<stdlib.h>

//-------------------------------------------------------------------------------
//void deJiShu(int num){
//	
//	//计数
//	int count = 0;
//
//	int num1 = 0;
//
//	while (num != num1){
//
//		if (1 == num1 % 2){
//			count++;
//			printf("第%d个奇数为%d\n", count, num1);
//			
//		}
//		
//		num1++;
//	}
//}
//
//-------------------------------------------------------------------------------
//void panDuan(int num){
//	if (1 == num % 2){
//		printf("输入的函数为奇数！！");
//	}else{
//		printf("输入的函数bushi奇数！！");
//	}
//
//}
                                                                                                                                                                                                                    
//-------------------------------------------------------------------------------
//int jieCheng(int num){
//
//	//阶乘初始数
//	int begin = 1;
//
//	for (int i = 1; i <= num; i++){
//		begin = begin * i;
//	}
//	printf("%d\n", begin);
//}
//-------------------------------------------------------------------------------
//
////计算 1！+2！+3！....+10！
//void add(){
//
//	int num = 0;
//	int begain = 1;
//
//	for (int i = 1; i <= 10; i++){
//		for (int a = 1; a <= i; a++){
//
//			begain = begain * a;
//
//		}
//
//		num = begain + num;
//		begain = 1;
//
//	}
//
//	printf("%d\n", num);
//}
//-------------------------------------------------------------------------------





int main(){

	//输入密码，错误三次提醒
    //-------------------------------------------------------------------------------
	//密码次数计数
	int i = 0;

	//储存输入密码
	char password[20] = { 0 };

	//输入的密码
	char code[20] = { 0 };

	//储存密码
	printf("请输入初始化密码");
	scanf_s("%s", password, 20);

	//输入密码
	printf("请输入登录密码");
	scanf_s("%s", code, 20);

	//密码正确和错误,错误三次警告！


	while (i != 3){
		if (strcmp(password, code) == 0){     //----------------->  strcmp()  比较字符串，正确为0
			printf("密码正确！！！！");
			break;
		}
		else{
			printf("密码错误了！！！！！");
			
		}
		i++;
	}

	if (3 == i){
		printf("密码输入错误超过三次！！！！！");

	}
	//-------------------------------------------------------------------------------

















	//-------------------------------------------------------------------------------
	//char arr[] = { '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', 0 };
	//char arr1[] = { 'H', 'e', 'l', 'l', 'o', 'w', ' ', 'W', 'o', 'r', 'l', 'd', '!', 0};

	//int left = 0;
	//int right = (sizeof(arr) / sizeof(arr[0]))-2;
	//while (left <= right){

	//	arr[left] = arr1[left];
	//	arr[right] = arr1[right];
	//	printf("%s\n", arr); 

	//	//休息1000ms
	//	Sleep(800);

	//	//清屏
	//	system("cls");

	//	left++;
	//	right--;

	//}

	//H###########!
	//He#########d!
	//Hel#######ld!
	//Hell#####rld!
	//Hello###orld!
	//Hellow#World!
	//Hellow World!

	//-------------------------------------------------------------------------------




	////查找数组元素

	////数组元素下标
	//int index = 0;
	////要查找的元素
	//int result = 7;
	//int arr[10] = {1,2,3,4,5,6,7,8,9,10};

	//while ( result != arr[index]){

	//	if (result == arr[index]){
	//		break;
	//	}
	//	index++;
	//}
	//printf("所查元素的下标为%d\n", index);

	//-------------------------------------------------------------------------------

















	//char ch = 0;

	//int ref = 0;

	//while ((ch = getchar()) != 'A'){
	//	putchar(ch);
	//
	//}
	//getchar();
	//ref = getchar();
	//if (ref == 'Y'){
	//	printf("yyyyyyyyyy");
	//}else{
	//	printf("nnnnnnnnnnn");
	//}



	
}