#include<stdio.h>
#include<stdlib.h>
//--------------------------------------------------------------------------
//void my_printf(int (*parr)[5], int hang, int lie){
//	int count = 0;
//	while (hang != count++){
//		for (int i = 0; i < lie; i++){
//			printf("%d\n", *((*parr) + i));
//		}
//		parr = parr + 1;
//	}
//
//
//
//} 
//--------------------------------------------------------------------------

//void my_printf(int (*parr)[5], int hang, int lie){
//	for (int i = 0; i < hang; i++){
//		for (int j = 0; j < lie; j++){
//			printf("%d ", *((*(parr+i))+j));
//		}
//		printf("\n");
//	}
//
//}
//--------------------------------------------------------------------------
										//通过函数指针 回调函数实现计算器
//int sum(int x, int y){
//	return x + y;
//}
//
//int sub(int x, int y){
//	return x - y;
//}
//
//int huidiao(int(*p)(int, int)){
//	return *p;
//}
//--------------------------------------------------------------------------
                                                   //qsort函数的使用
//int com1(const void* n1, const void* n2){
//	return (*(int *)n1) - (*(int *)n2);
//}
//--------------------------------------------------------------------------
													//模拟实现qsort函数

//void swap(char* e1, char* e2, int width){
//	//交换
//	int count = 1;
//	char temp = 0;
//
//	while (width != count){
//		//交换
//		temp = *e2;
//		*e2 = *e1;
//		*e1 = temp;
//
//		e1++;
//		e2++;
//
//		//计数
//		count++;
//	}
//
//
//}


//void my_qsort(void *base, int length, int width, int (*com)(const void* e1, const void* e2)){
//	//趟数
//	for (int i = 0; i < length; i++){
//		//每一趟交换
//		for (int j = 0; j < length - 1 - i; j++){
//			//通过函数指针判断
//			// >0 升序排列
//			if (  (*com)((char*)base + (j*width), (char*)base + ((j + 1) * width)) > 0){
//				//交换
//				swap((char*)base + (j*width), (char*)base + ((j + 1) * width), width);
//
//			}
//		}
//	}
//}

//--------------------------------------------------------------------------
int main(){
	//--------------------------------------------------------------------------











	//--------------------------------------------------------------------------
													//qsort函数的使用
	//int arr[10] = { 5, 8, 9, 6, 44, 2, 5, 6, 1, 0 };
	//int sz = sizeof(arr) / sizeof(arr[0]);
	//qsort(arr, sz, sizeof(arr[0]), &com);
	//for (int i = 0; i < 10; i++){
	//	printf("%d ", arr[i]);
	//}

	//--------------------------------------------------------------------------
	                                               //模拟实现qsort函数
	//int arr[10] = {5555,889,47,123,20,688,999,8884,555,10};
	//my_qsort(arr,10,4,&com1);
	//for (int i = 0; i < 10; i++){
	//	printf("%d ", arr[i]);
	//}







	//--------------------------------------------------------------------------
	//两个常量字符串的地址
	//char* p1 = "Hellow";
	//char* p2 = "Hellow";
	//printf("%p\n", p1);
	//printf("%p\n", p2);
	/*005E5858
	  005E5858*/                       //两个相同的常量首地址相同

	//--------------------------------------------------------------------------
	                                                        //指针数组
	//int a[] = { 1, 2, 3, 4, 5, 6, 7, 5 };
	//int b[] = { 5, 6, 89, 63, 5, 2 ,5,6};
	//int* arr[] = { a, b };
	//for (int i = 0; i < sizeof(arr) / sizeof(arr[0]); i++){
	//	for (int j = 0; j < 6; j++){
	//		printf("%d\n", *(arr[i]+j));
	//	}

	//}





	//--------------------------------------------------------------------------
	//int a = 0;
	//int* pa = &a;
	//int *pa1 = &a;
	//printf("%p\n",pa); 
	//printf("%p\n",pa1);


	//--------------------------------------------------------------------------

	//int arr[10] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
	////取数组指针
	//int (*parr)[10] = &arr;
	//for (int i = 0; i < 10; i++){

	//	
	//	printf("%p\n", ((*parr) + i));
	//	 
	//}

	//--------------------------------------------------------------------------
	//                                         二维数组传参表示第一行地址！！1
	

	//int arr[3][5] = { {1,2,3,4,5}, {6,7,8,9,10}, {7,8,9,10,11} };
	//
	//my_printf(arr,3,5);
	//--------------------------------------------------------------------------
	                                      //通过函数指针 回调函数实现计算器

	//写一个回调函数,传函数指针           
	//回调函数理解为，通过一个函数，把A函数函数指针传过去，通过这个函数调用A
	/*printf("%d ", huidiao(sum(1, 5)));*/





	return 0; 
}