#include<stdio.h>
#include"printf_count.h"




int main(){
	////提供打印的数
	//int i = 15;
	//int num = -1;
	////打印二进制数的函数
	////printf_2(i);
	//printf("\n----------------------------------\n");
	////判断一个数的二进制有多少个1
	////judge_2(-1);
	////judge_2(num);


//=============================================================================
	//int count = 0;
	//int n = -1;
	//while (n){

	//	n = n & (n - 1);
	//	count++;

	//}
	//printf("%d\n", count);

//=============================================================================
	//输入两个数，判断二进制中不同的个数有几个
	//printf("%d\n", my_compare(1111, 2222));
	////通过异或进行比较
	//printf("%d\n", my_compare2(1111, 2222));

//=============================================================================
	//分别打印一个数的二进制位的奇数和偶数位
	//15-----> 00000000 00000000 00000000 00001111
	/*my_printf3(-1);*/


//=============================================================================
	//int a = 10;
	//int b = 20;
	//a = a^b;
	//b = a^b;  =     b =a^b^b= a 
	//a = a^b;  =     a = a^a^0
	//printf("%d%d", a, b);



	return 0;
}